; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_2 type_3)
 (:predicates (pred_3 ?v4 - type_2 ?v2 - type_1)
 	      (pred_1 ?v5 - object ?v2 - type_1)
	      (pred_4 ?v4 - type_2 ?v7 - type_3)
	      (pred_2 ?v4 - type_2 ?v5 - object ?v7 - type_3))

   (:action op_3
       :parameters  (?v4 - type_2 ?v3 ?v8 - type_1)
       :precondition (and  (pred_3 ?v4 ?v3))
       :effect (and  (pred_3 ?v4 ?v8)
		     (not (pred_3 ?v4 ?v3))))

   (:action op_1
       :parameters (?v4 - type_2 ?v6 - object ?v1 - type_1 ?v7 - type_3)
       :precondition  (and  (pred_1 ?v6 ?v1) (pred_3 ?v4 ?v1) (pred_4 ?v4 ?v7))
       :effect (and (pred_2 ?v4 ?v6 ?v7)
		    (not (pred_1 ?v6 ?v1)) 
		    (not (pred_4 ?v4 ?v7))))

   (:action op_2
       :parameters (?v4 - type_2 ?v6 - object ?v1 - type_1 ?v7 - type_3)
       :precondition  (and  (pred_2 ?v4 ?v6 ?v7) (pred_3 ?v4 ?v1))
       :effect (and (pred_1 ?v6 ?v1)
		    (pred_4 ?v4 ?v7)
		    (not (pred_2 ?v4 ?v6 ?v7)))))

; problem
(define (problem gripper-2-4-3)
(:domain gripper-strips)
(:objects obj_12 obj_03 - type_2
obj_02 obj_13 obj_11 obj_05 - type_3
obj_10 obj_08 obj_06 obj_09 - type_1
obj_07 obj_04 obj_01 - object)
(:init
(pred_3 obj_12 obj_06)
(pred_4 obj_12 obj_02)
(pred_4 obj_12 obj_13)
(pred_3 obj_03 obj_09)
(pred_4 obj_03 obj_11)
(pred_4 obj_03 obj_05)
(pred_1 obj_07 obj_09)
(pred_1 obj_04 obj_09)
(pred_1 obj_01 obj_06)
)
(:goal
(and
(pred_1 obj_07 obj_10)
(pred_1 obj_04 obj_09)
(pred_1 obj_01 obj_08)
)
)

(:constraints
  (always (not (pred_3 obj_12 obj_08)))
)
)

; plan
1. (op_1 obj_03 obj_07 obj_09 obj_05)
   deleted: (pred_1 obj_07 obj_09) (pred_4 obj_03 obj_05)
   added: (pred_2 obj_03 obj_07 obj_05)
   goals met: 1 of 3
2. (op_1 obj_12 obj_01 obj_06 obj_13)
   deleted: (pred_1 obj_01 obj_06) (pred_4 obj_12 obj_13)
   added: (pred_2 obj_12 obj_01 obj_13)
   goals met: 1 of 3
3. (op_3 obj_03 obj_09 obj_10)
   deleted: (pred_3 obj_03 obj_09)
   added: (pred_3 obj_03 obj_10)
   goals met: 1 of 3
4. (op_3 obj_12 obj_06 obj_10)
   deleted: (pred_3 obj_12 obj_06)
   added: (pred_3 obj_12 obj_10)
   goals met: 1 of 3
5. (op_2 obj_03 obj_07 obj_10 obj_05)
   deleted: (pred_2 obj_03 obj_07 obj_05)
   added: (pred_1 obj_07 obj_10) (pred_4 obj_03 obj_05)
   goals met: 2 of 3
6. (op_2 obj_12 obj_01 obj_10 obj_13)
   deleted: (pred_2 obj_12 obj_01 obj_13)
   added: (pred_1 obj_01 obj_10) (pred_4 obj_12 obj_13)
   goals met: 2 of 3
7. (op_1 obj_03 obj_01 obj_10 obj_05)
   deleted: (pred_1 obj_01 obj_10) (pred_4 obj_03 obj_05)
   added: (pred_2 obj_03 obj_01 obj_05)
   goals met: 2 of 3
8. (op_3 obj_03 obj_10 obj_08)
   deleted: (pred_3 obj_03 obj_10)
   added: (pred_3 obj_03 obj_08)
   goals met: 2 of 3
9. (op_2 obj_03 obj_01 obj_08 obj_05)
   deleted: (pred_2 obj_03 obj_01 obj_05)
   added: (pred_1 obj_01 obj_08) (pred_4 obj_03 obj_05)
   goals met: 3 of 3
